# PROYECTO 1

## Ejercicio 1

In [ ]:
# Importamos las librerías necesarias
import pandas as pd
import numpy as np

In [ ]:
'''
En este ejercicio se realiza las procedimientos para mostrar las ultimas 5 ventas que el usuario va ingresando
al dataFrame
'''

# Inicializamos un identificador para verificar si el usuario seguira ingresando datos
n = 'y'

# Establecemos las columnas iniciales y creamos un dataFrame vacío
columnas = ['Fecha','Precio_unit', 'Ventas']
df = pd.DataFrame()

# En este bucle validamos si se continuará pidiendo datos
while n =='y':

    # solicitamos al usuario los datos necesarios y los guardamos e identificadores
    fecha = input("ingrese fecha (dd-mm-aaaa): ") 
    precio_unit = int(input('ingrese precio unitario del producto: '))
    ventas = int(input('Ingrese cantidad de ventas del día: '))

    # Posteriormente guardamos los datos en un dataFrame
    add_row = pd.DataFrame([[fecha,precio_unit,ventas]], columns=columnas)
    
    # Concatenamos los datos ingresados y vamos llenando el dataFrame vacío
    df = pd.concat([df, add_row], ignore_index=True)

    # Generamos la ganancia sin descuento y con descuento
    df['Ganancia'] = df['Ventas']*df['Precio_unit']
    df['Ganancia_Desc_5%'] = (df['Precio_unit'] - df['Precio_unit']*0.05).round(2)*df['Ventas']

    #Preguntamos si se desea ingresar más productos
    n = input('Desea ingresar otro producto? (y/n): ')

# Finalmente mostramos los ultimos 5 productos ingresados    
df.sort_values('Fecha').tail(5)

## Ejercicio 2

In [6]:
ingresos = {
    "empleado1": 200,
    "empleado2": 435,
    "empleado3": 567,
    "empleado4": 123,
    "empleado5": 657,
    "empleado6": 876,
    "empleado7": 1023,
    "empleado8": 2134,
    "empleado9": 21343
}

# Creamos un dataFrame con los valores del diccionario como datos principales
# Creamos los index del dataFrame con los 'keys' del diccionario y colocamos la columan de ingresos
df2 = pd.DataFrame(ingresos.values(),
                   index=ingresos.keys(),
                   columns=["Ingreso"])

# Guardamos la descripción del dataFrame en un identificador
df2_desc = df2.describe().round(1)

# Colocamos un nombre a la columna
df2_desc.columns = ["Datos_estadísticos"]

# Y seleccionamos solo los datos que se desean mostrar (min, max, media)
datos = ['min', 'max', 'mean']
df2_desc.loc[df2_desc.index.isin(datos)]

      Datos_estadísticos
mean              3039.8
min                123.0
max              21343.0

## Ejercicio 3

In [7]:
# Creamos un diccionario con los datos del ejercicio
data3 = {
    "Mes":["Enero", "Febrero", "Marzo", "Abril", "Mayo"],
    "Ventas":[30500, 35600, 28300, 33900, 42500],
    "Gastos":[22000, 23450, 18100, 35700, 32450]
}
# Creamos un dataFrame con los datos
df3 = pd.DataFrame(data3)

# 1. Columna 1 = Gasto/Ventas*100
# Realizamos los calculos y guardamos en una nueva columna
df3['Columna 1'] = ((df3['Gastos']/df3['Ventas'])*100).round(2)

# 2. Columna 2 = Si Ventas>= 30000, imprimir “Meta Superada”, caso contrario imprimir “Meta no Superada”.
# Hacemos uso de la función "lambda" para aplicar la condición e imprimir si se superó la meta
df3['Columna 2'] = df3['Ventas'].apply(lambda x : "Meta superada" if x>= 30000 else "Meta no superada")

# 3. Columna 3 = Si Gasto>Ventas, calcular el sobre gasto.
# Usamos la funcion "where" de "numpy" para verificar la condicionas fila a fila y colocamos la diferencia si se cumple
df3['Columna 3'] = np.where(df3['Gastos']>df3['Ventas'], df3['Gastos']-df3['Ventas'], np.nan)

#Mostramos la data oculatando los index
df3.style.hide(axis='index')

In [8]:
# 4. Obtener el total de las ventas de los últimos 3 meses
df3.tail(3)

     Mes  Ventas  Gastos  Columna 1         Columna 2  Columna 3
2  Marzo   28300   18100      63.96  Meta no superada        NaN
3  Abril   33900   35700     105.31     Meta superada     1800.0
4   Mayo   42500   32450      76.35     Meta superada        NaN

In [9]:
# 5. Obtener el total de gastos de febrero a abril
meses = ['Febrero', 'Marzo', 'Abril']
# Para la columna "Gastos" verificamos que los elementos de la columna "Mes" se encuentren en la lista "meses",
# si es el caso entonces sumamos el total de gastos
print("Total gastos de 'Febrero', 'Marzo' y 'Abril' es: ", df3['Gastos'][df3['Mes'].isin(meses)].sum())

Total gastos de 'Febrero', 'Marzo' y 'Abril' es:  77250

## Ejercicio 4

In [10]:
# Cargamos la data del archivo CSV
df4 = pd.read_csv('Data - Riesgos.csv', index_col='ID')

# Con size obtenemos la cantidad total de datos
print("Cantidad de datos: ",df4.size)
print("")
# Con shape obtenemos las dimensiones del dataFrame
print("Dimensiones del DataFrame: ",df4.shape)
print("")
# Con columns tenemos los nombres de las columnas
print("Columnas: ",df4.columns)
print("")
# Con index tenemos los nombres de las filas
print("Filas: ",df4.index)
print("")
# dytpes nos sirve para obtener los tipos de datos de las columnas
print(df4.dtypes)

Cantidad de datos:  40500

Dimensiones del DataFrame:  (4500, 9)

Columnas:  Index(['edad', 'meses', 'max_ant', 'ingreso', 'score', 'tipo_vivienda', 'zona',
       'nivel', 'riesgo'],
      dtype='object')

Filas:  Int64Index([2208, 2211, 2212, 2216, 2218, 2219, 2226, 2227, 2228, 2230,
            ...
            1486, 1487, 1488, 1491, 1493, 1494, 1495, 1496, 1497, 1499],
           dtype='int64', name='ID', length=4500)

edad             float64
meses            float64
max_ant          float64
ingreso          float64
score            float64
tipo_vivienda      int64
zona             float64
nivel              int64
riesgo             int64
dtype: object

In [11]:
# Mostramos las 10 primeras filas con la funcion head
df4.head(10)

      edad  meses  max_ant  ingreso  score  tipo_vivienda  zona  nivel  riesgo
ID
2208  33.0  128.0      6.0   3230.0  192.0              2   3.0      2       1
2211  32.0  185.0      7.0   2930.0  217.0              2   1.0      5       1
2212  28.0    NaN      7.0   1883.7  202.0              2   1.0      2       1
2216  56.0  200.0      0.0    850.0  194.0              2   1.0      5       1
2218  32.0  131.0     65.0   3200.0  200.0              2   1.0      2       1
2219  34.0  145.0      6.0   7000.0  196.0              2   5.0      2       1
2226   NaN  114.0      0.0   2171.5  178.0              2   2.0      1       1
2227  27.0  116.0      0.0    800.0  169.0              2   1.0      5       1
2228  26.0  182.0      6.0   3150.0  190.0              4   3.0      5       1
2230  25.0  154.0      1.0   2600.0  189.0              2   1.0      2       1

In [12]:
# Mostramos las 10 ultimas filas con la función tail
df4.tail(10)

,edad,meses,max_ant,ingreso,score,tipo_vivienda,zona,nivel,riesgo
ID,,,,,,,,,
1486,59.0,288.0,0.0,30000.00,207.0,2,1.0,2,0
1487,55.0,294.0,57.0,9300.00,238.0,4,1.0,2,0
1488,53.0,148.0,106.0,30000.00,219.0,4,1.0,2,0
1491,29.0,198.0,94.0,5250.00,214.0,2,1.0,2,0
1493,32.0,195.0,41.0,7500.00,219.0,2,1.0,2,0
1494,54.0,510.0,87.0,24000.00,214.0,2,1.0,2,0
1495,63.0,305.0,99.0,9880.73,219.0,2,5.0,2,0
1496,48.0,194.0,124.0,23000.00,224.0,4,1.0,2,0
1497,39.0,245.0,121.0,12450.00,240.0,4,5.0,2,0
1499,65.0,674.0,38.0,20000.00,238.0,4,5.0,2,0

In [13]:
# Para verificar si tenemos datos nulos, usamos la función 'isnull' y luego sumamos la cantiad de datos nulos para analizarlo
df4.isnull().sum()

edad             13
meses             6
max_ant           4
ingreso           5
score             5
tipo_vivienda     0
zona              6
nivel             0
riesgo            0
dtype: int64

In [14]:
# Si queremos guardar en un contenerdor, usamos la función 'copy()' para que nuestra data original no se altere
# Adicionalmente seleccionamos las 10 primeras filas del dataFrame
df4_head_100 = df4.head(100).copy()
df4_head_100

      edad  meses  max_ant  ingreso  score  tipo_vivienda  zona  nivel  riesgo
ID
2208  33.0  128.0      6.0  3230.00  192.0              2   3.0      2       1
2211  32.0  185.0      7.0  2930.00  217.0              2   1.0      5       1
2212  28.0    NaN      7.0  1883.70  202.0              2   1.0      2       1
2216  56.0  200.0      0.0   850.00  194.0              2   1.0      5       1
2218  32.0  131.0     65.0  3200.00  200.0              2   1.0      2       1
...    ...    ...      ...      ...    ...            ...   ...    ...     ...
2387  41.0  141.0      0.0  3420.36  214.0              4   2.0      1       1
2389  29.0  159.0     17.0  1157.06  163.0              2   4.0      2       1
2391  27.0  122.0      NaN  2000.00  188.0              2   1.0      2       1
2392  35.0  111.0      0.0   812.53  177.0              2   1.0      5       1
2394  28.0  137.0      0.0  2000.00  175.0              3   1.0      5       1

[100 rows x 9 columns]